noahzwiep/Capstone/board/pin_mux.c
    gpio_pin_config_t RIGHT_MOTOR_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 36)  */
    GPIO_PinInit(BOARD_RIGHT_MOTOR_B_GPIO, BOARD_RIGHT_MOTOR_B_PIN, &RIGHT_MOTOR_B_config);

    gpio_pin_config_t ENCODER1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB9 (pin 57)  */
    GPIO_PinInit(BOARD_ENCODER1_GPIO, BOARD_ENCODER1_PIN, &ENCODER1_config);

    gpio_pin_config_t MPU6050_INTERRUPT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB11 (pin 59)  */
    GPIO_PinInit(BOARD_MPU6050_INTERRUPT_GPIO, BOARD_MPU6050_INTERRUPT_PIN, &MPU6050_INTERRUPT_config);

    gpio_pin_config_t RIGHT_MOTOR_A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB23 (pin 69)  */
    GPIO_PinInit(BOARD_RIGHT_MOTOR_A_GPIO, BOARD_RIGHT_MOTOR_A_PIN, &RIGHT_MOTOR_A_config);

    gpio_pin_config_t FRONT_LEFT_ACT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 70)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_ACT_GPIO, BOARD_FRONT_LEFT_ACT_PIN, &FRONT_LEFT_ACT_config);

    gpio_pin_config_t AUTO_MODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC1 (pin 71)  */
    GPIO_PinInit(BOARD_AUTO_MODE_GPIO, BOARD_AUTO_MODE_PIN, &AUTO_MODE_config);

    gpio_pin_config_t MOTOR_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC2 (pin 72)  */
    GPIO_PinInit(BOARD_MOTOR_EN_GPIO, BOARD_MOTOR_EN_PIN, &MOTOR_EN_config);

    gpio_pin_config_t LEFT_MOTOR_A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 73)  */
    GPIO_PinInit(BOARD_LEFT_MOTOR_A_GPIO, BOARD_LEFT_MOTOR_A_PIN, &LEFT_MOTOR_A_config);

    gpio_pin_config_t FRONT_LEFT_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC5 (pin 77)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_LIMIT_GPIO, BOARD_FRONT_LEFT_LIMIT_PIN, &FRONT_LEFT_LIMIT_config);

    gpio_pin_config_t FRONT_RIGHT_LIMIT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_LIMIT_GPIO, BOARD_FRONT_RIGHT_LIMIT_PIN, &FRONT_RIGHT_LIMIT_config);

    gpio_pin_config_t MANUAL_MODE_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC8 (pin 80)  */
    GPIO_PinInit(BOARD_MANUAL_MODE_GPIO, BOARD_MANUAL_MODE_PIN, &MANUAL_MODE_config);

    gpio_pin_config_t FRONT_RIGHT_ACT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC9 (pin 81)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_ACT_GPIO, BOARD_FRONT_RIGHT_ACT_PIN, &FRONT_RIGHT_ACT_config);

    gpio_pin_config_t RIGHT_ENCODER_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC10 (pin 82)  */
    GPIO_PinInit(BOARD_RIGHT_ENCODER_1_GPIO, BOARD_RIGHT_ENCODER_1_PIN, &RIGHT_ENCODER_1_config);

    gpio_pin_config_t RIGHT_ENCODER_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC11 (pin 83)  */
    GPIO_PinInit(BOARD_RIGHT_ENCODER_2_GPIO, BOARD_RIGHT_ENCODER_2_PIN, &RIGHT_ENCODER_2_config);

    gpio_pin_config_t LEFT_MOTOR_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 84)  */
    GPIO_PinInit(BOARD_LEFT_MOTOR_B_GPIO, BOARD_LEFT_MOTOR_B_PIN, &LEFT_MOTOR_B_config);

    gpio_pin_config_t FRONT_RIGHT_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD1 (pin 94)  */
    GPIO_PinInit(BOARD_FRONT_RIGHT_RPM_GPIO, BOARD_FRONT_RIGHT_RPM_PIN, &FRONT_RIGHT_RPM_config);

    gpio_pin_config_t REAR_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD2 (pin 95)  */
    GPIO_PinInit(BOARD_REAR_RPM_GPIO, BOARD_REAR_RPM_PIN, &REAR_RPM_config);

    gpio_pin_config_t FRONT_LEFT_RPM_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD3 (pin 96)  */
    GPIO_PinInit(BOARD_FRONT_LEFT_RPM_GPIO, BOARD_FRONT_LEFT_RPM_PIN, &FRONT_LEFT_RPM_config);

    gpio_pin_config_t LED_ERROR_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE26 (pin 33)  */
    GPIO_PinInit(BOARD_LED_ERROR_GPIO, BOARD_LED_ERROR_PIN, &LED_ERROR_config);

    /* PORTA1 (pin 35) is configured as PTA1 */
    PORT_SetPinMux(BOARD_ENCODER2_PORT, BOARD_ENCODER2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA1 (pin 35): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_ENCODER2_PORT, BOARD_ENCODER2_PIN, kPORT_InterruptFallingEdge);

    PORTA->PCR[1] = ((PORTA->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_DSE_MASK | PORT_PCR_ISF_MASK)))

                     /* Drive Strength Enable: Low drive strength is configured on the corresponding pin, if pin
                      * is configured as a digital output. */
                     | PORT_PCR_DSE(kPORT_LowDriveStrength)

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

