noahzwiep/Capstone/board/pin_mux.c
    /* PORTA2 (pin 36) is configured as PTA2 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_B_PORT, BOARD_RIGHT_MOTOR_B_PIN, kPORT_MuxAsGpio);

    /* PORTB11 (pin 59) is configured as PTB11 */
    PORT_SetPinMux(BOARD_MPU6050_INTERRUPT_PORT, BOARD_MPU6050_INTERRUPT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB11 (pin 59): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_MPU6050_INTERRUPT_PORT, BOARD_MPU6050_INTERRUPT_PIN, kPORT_InterruptRisingEdge);

    /* PORTB2 (pin 55) is configured as ADC0_SE12 */
    PORT_SetPinMux(BOARD_ADC0_SE12_PORT, BOARD_ADC0_SE12_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB23 (pin 69) is configured as PTB23 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_A_PORT, BOARD_RIGHT_MOTOR_A_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin 57) is configured as PTB9 */
    PORT_SetPinMux(BOARD_ENCODER1_PORT, BOARD_ENCODER1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB9 (pin 57): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_ENCODER1_PORT, BOARD_ENCODER1_PIN, kPORT_InterruptFallingEdge);

    PORTB->PCR[9] = ((PORTB->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTC0 (pin 70) is configured as PTC0 */
    PORT_SetPinMux(BOARD_FRONT_LEFT_ACT_PORT, BOARD_FRONT_LEFT_ACT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC0 (pin 70): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_LEFT_ACT_PORT, BOARD_FRONT_LEFT_ACT_PIN, kPORT_InterruptRisingEdge);

    /* PORTC1 (pin 71) is configured as PTC1 */
    PORT_SetPinMux(BOARD_AUTO_MODE_PORT, BOARD_AUTO_MODE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC1 (pin 71): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_AUTO_MODE_PORT, BOARD_AUTO_MODE_PIN, kPORT_InterruptRisingEdge);

    /* PORTC10 (pin 82) is configured as PTC10 */
    PORT_SetPinMux(BOARD_RIGHT_ENCODER_1_PORT, BOARD_RIGHT_ENCODER_1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC10 (pin 82): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_RIGHT_ENCODER_1_PORT, BOARD_RIGHT_ENCODER_1_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[10] = ((PORTC->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC11 (pin 83) is configured as PTC11 */
    PORT_SetPinMux(BOARD_RIGHT_ENCODER_2_PORT, BOARD_RIGHT_ENCODER_2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC11 (pin 83): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_RIGHT_ENCODER_2_PORT, BOARD_RIGHT_ENCODER_2_PIN, kPORT_InterruptFallingEdge);

    PORTC->PCR[11] = ((PORTC->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | PORT_PCR_PS(kPORT_PullUp));

    /* PORTC12 (pin 84) is configured as PTC12 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_B_PORT, BOARD_LEFT_MOTOR_B_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 90) is configured as UART3_RX */
    PORT_SetPinMux(BOARD_GPS_RX_PORT, BOARD_GPS_RX_PIN, kPORT_MuxAlt3);

    /* PORTC17 (pin 91) is configured as UART3_TX */
    PORT_SetPinMux(BOARD_GPS_TX_PORT, BOARD_GPS_TX_PIN, kPORT_MuxAlt3);

    /* PORTC2 (pin 72) is configured as PTC2 */
    PORT_SetPinMux(BOARD_MOTOR_EN_PORT, BOARD_MOTOR_EN_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 73) is configured as PTC3 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_A_PORT, BOARD_LEFT_MOTOR_A_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 76) is configured as FTM0_CH3 */
    PORT_SetPinMux(BOARD_RIGHT_MOTOR_PWM_PORT, BOARD_RIGHT_MOTOR_PWM_PIN, kPORT_MuxAlt4);

    /* PORTC5 (pin 77) is configured as PTC5 */
    PORT_SetPinMux(BOARD_FRONT_LEFT_LIMIT_PORT, BOARD_FRONT_LEFT_LIMIT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC5 (pin 77): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_LEFT_LIMIT_PORT, BOARD_FRONT_LEFT_LIMIT_PIN, kPORT_InterruptRisingEdge);

    /* PORTC7 (pin 79) is configured as PTC7 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_LIMIT_PORT, BOARD_FRONT_RIGHT_LIMIT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC7 (pin 79): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_LIMIT_PORT, BOARD_FRONT_RIGHT_LIMIT_PIN, kPORT_InterruptRisingEdge);

    /* PORTC8 (pin 80) is configured as PTC8 */
    PORT_SetPinMux(BOARD_MANUAL_MODE_PORT, BOARD_MANUAL_MODE_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC8 (pin 80): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_MANUAL_MODE_PORT, BOARD_MANUAL_MODE_PIN, kPORT_InterruptRisingEdge);

    /* PORTC9 (pin 81) is configured as PTC9 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_ACT_PORT, BOARD_FRONT_RIGHT_ACT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC9 (pin 81): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_ACT_PORT, BOARD_FRONT_RIGHT_ACT_PIN, kPORT_InterruptRisingEdge);

    /* PORTD0 (pin 93) is configured as FTM3_CH0 */
    PORT_SetPinMux(BOARD_LEFT_MOTOR_FTM_PORT, BOARD_LEFT_MOTOR_FTM_PIN, kPORT_MuxAlt4);

    /* PORTD1 (pin 94) is configured as PTD1 */
    PORT_SetPinMux(BOARD_FRONT_RIGHT_RPM_PORT, BOARD_FRONT_RIGHT_RPM_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD1 (pin 94): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_FRONT_RIGHT_RPM_PORT, BOARD_FRONT_RIGHT_RPM_PIN, kPORT_InterruptFallingEdge);

    PORTD->PCR[1] = ((PORTD->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullUp));

    /* PORTD2 (pin 95) is configured as PTD2 */
    PORT_SetPinMux(BOARD_REAR_RPM_PORT, BOARD_REAR_RPM_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD2 (pin 95): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_REAR_RPM_PORT, BOARD_REAR_RPM_PIN, kPORT_InterruptFallingEdge);

